---
kind: type
id: T:Autodesk.Revit.DB.WallSweep
source: html/8edb03ef-dc10-04d8-d8ea-6342e4a2185b.htm
---
# Autodesk.Revit.DB.WallSweep

Represents a wall sweep or reveal.

## Syntax (C#)
```csharp
public class WallSweep : HostObject
```

## Remarks
This element may represent either a standalone sweep or reveal element created by the Revit user interface
 or API, or a "fixed" wall sweep or reveal that was created by the contents of a wall's compound structure.